virtualabs/cutcutgo/cutcutgo.X/src/packs/ATSAMG55J19_DFP/component/tc.h
/* -------- TC_WPMR : (TC Offset: 0xE4) (R/W 32) Write Protection Mode Register -------- */
#define TC_WPMR_WPEN_Pos                      _U_(0)                                               /**< (TC_WPMR) Write Protection Enable Position */
#define TC_WPMR_WPEN_Msk                      (_U_(0x1) << TC_WPMR_WPEN_Pos)                       /**< (TC_WPMR) Write Protection Enable Mask */
#define TC_WPMR_WPEN(value)                   (TC_WPMR_WPEN_Msk & ((value) << TC_WPMR_WPEN_Pos))  
#define TC_WPMR_WPKEY_Pos                     _U_(8)                                               /**< (TC_WPMR) Write Protection Key Position */
#define TC_WPMR_WPKEY_Msk                     (_U_(0xFFFFFF) << TC_WPMR_WPKEY_Pos)                 /**< (TC_WPMR) Write Protection Key Mask */
#define TC_WPMR_WPKEY(value)                  (TC_WPMR_WPKEY_Msk & ((value) << TC_WPMR_WPKEY_Pos))
#define   TC_WPMR_WPKEY_PASSWD_Val            _U_(0x54494D)                                        /**< (TC_WPMR) Writing any other value in this field aborts the write operation of the WPEN bit.Always reads as 0.  */
#define TC_WPMR_WPKEY_PASSWD                  (TC_WPMR_WPKEY_PASSWD_Val << TC_WPMR_WPKEY_Pos)      /**< (TC_WPMR) Writing any other value in this field aborts the write operation of the WPEN bit.Always reads as 0. Position  */
#define TC_WPMR_Msk                           _U_(0xFFFFFF01)                                      /**< (TC_WPMR) Register Mask  */


/* -------- TC_RPR0 : (TC Offset: 0x100) (R/W 32) Receive Pointer Register -------- */
#define TC_RPR0_RXPTR_Pos                     _U_(0)                                               /**< (TC_RPR0) Receive Pointer Register Position */
#define TC_RPR0_RXPTR_Msk                     (_U_(0xFFFFFFFF) << TC_RPR0_RXPTR_Pos)               /**< (TC_RPR0) Receive Pointer Register Mask */
#define TC_RPR0_RXPTR(value)                  (TC_RPR0_RXPTR_Msk & ((value) << TC_RPR0_RXPTR_Pos))
#define TC_RPR0_Msk                           _U_(0xFFFFFFFF)                                      /**< (TC_RPR0) Register Mask  */


/* -------- TC_RNPR0 : (TC Offset: 0x110) (R/W 32) Receive Next Pointer Register -------- */
#define TC_RNPR0_RXNPTR_Pos                   _U_(0)                                               /**< (TC_RNPR0) Receive Next Pointer Position */
#define TC_RNPR0_RXNPTR_Msk                   (_U_(0xFFFFFFFF) << TC_RNPR0_RXNPTR_Pos)             /**< (TC_RNPR0) Receive Next Pointer Mask */
#define TC_RNPR0_RXNPTR(value)                (TC_RNPR0_RXNPTR_Msk & ((value) << TC_RNPR0_RXNPTR_Pos))
#define TC_RNPR0_Msk                          _U_(0xFFFFFFFF)                                      /**< (TC_RNPR0) Register Mask  */


/* -------- TC_RNCR0 : (TC Offset: 0x114) (R/W 32) Receive Next Counter Register -------- */
#define TC_RNCR0_RXNCTR_Pos                   _U_(0)                                               /**< (TC_RNCR0) Receive Next Counter Position */
#define TC_RNCR0_RXNCTR_Msk                   (_U_(0xFFFF) << TC_RNCR0_RXNCTR_Pos)                 /**< (TC_RNCR0) Receive Next Counter Mask */
#define TC_RNCR0_RXNCTR(value)                (TC_RNCR0_RXNCTR_Msk & ((value) << TC_RNCR0_RXNCTR_Pos))
#define TC_RNCR0_Msk                          _U_(0x0000FFFF)                                      /**< (TC_RNCR0) Register Mask  */


/* -------- TC_PTCR0 : (TC Offset: 0x120) ( /W 32) Transfer Control Register -------- */
#define TC_PTCR0_RXTEN_Pos                    _U_(0)                                               /**< (TC_PTCR0) Receiver Transfer Enable Position */
#define TC_PTCR0_RXTEN_Msk                    (_U_(0x1) << TC_PTCR0_RXTEN_Pos)                     /**< (TC_PTCR0) Receiver Transfer Enable Mask */
#define TC_PTCR0_RXTEN(value)                 (TC_PTCR0_RXTEN_Msk & ((value) << TC_PTCR0_RXTEN_Pos))
#define TC_PTCR0_RXTDIS_Pos                   _U_(1)                                               /**< (TC_PTCR0) Receiver Transfer Disable Position */
#define TC_PTCR0_RXTDIS_Msk                   (_U_(0x1) << TC_PTCR0_RXTDIS_Pos)                    /**< (TC_PTCR0) Receiver Transfer Disable Mask */
#define TC_PTCR0_RXTDIS(value)                (TC_PTCR0_RXTDIS_Msk & ((value) << TC_PTCR0_RXTDIS_Pos))
#define TC_PTCR0_TXTEN_Pos                    _U_(8)                                               /**< (TC_PTCR0) Transmitter Transfer Enable Position */
#define TC_PTCR0_TXTEN_Msk                    (_U_(0x1) << TC_PTCR0_TXTEN_Pos)                     /**< (TC_PTCR0) Transmitter Transfer Enable Mask */
#define TC_PTCR0_TXTEN(value)                 (TC_PTCR0_TXTEN_Msk & ((value) << TC_PTCR0_TXTEN_Pos))
#define TC_PTCR0_TXTDIS_Pos                   _U_(9)                                               /**< (TC_PTCR0) Transmitter Transfer Disable Position */
#define TC_PTCR0_TXTDIS_Msk                   (_U_(0x1) << TC_PTCR0_TXTDIS_Pos)                    /**< (TC_PTCR0) Transmitter Transfer Disable Mask */
#define TC_PTCR0_TXTDIS(value)                (TC_PTCR0_TXTDIS_Msk & ((value) << TC_PTCR0_TXTDIS_Pos))
#define TC_PTCR0_RXCBEN_Pos                   _U_(16)                                              /**< (TC_PTCR0) Receiver Circular Buffer Enable Position */
#define TC_PTCR0_RXCBEN_Msk                   (_U_(0x1) << TC_PTCR0_RXCBEN_Pos)                    /**< (TC_PTCR0) Receiver Circular Buffer Enable Mask */
#define TC_PTCR0_RXCBEN(value)                (TC_PTCR0_RXCBEN_Msk & ((value) << TC_PTCR0_RXCBEN_Pos))
#define TC_PTCR0_RXCBDIS_Pos                  _U_(17)                                              /**< (TC_PTCR0) Receiver Circular Buffer Disable Position */
#define TC_PTCR0_RXCBDIS_Msk                  (_U_(0x1) << TC_PTCR0_RXCBDIS_Pos)                   /**< (TC_PTCR0) Receiver Circular Buffer Disable Mask */
#define TC_PTCR0_RXCBDIS(value)               (TC_PTCR0_RXCBDIS_Msk & ((value) << TC_PTCR0_RXCBDIS_Pos))
#define TC_PTCR0_TXCBEN_Pos                   _U_(18)                                              /**< (TC_PTCR0) Transmitter Circular Buffer Enable Position */
#define TC_PTCR0_TXCBEN_Msk                   (_U_(0x1) << TC_PTCR0_TXCBEN_Pos)                    /**< (TC_PTCR0) Transmitter Circular Buffer Enable Mask */
#define TC_PTCR0_TXCBEN(value)                (TC_PTCR0_TXCBEN_Msk & ((value) << TC_PTCR0_TXCBEN_Pos))
#define TC_PTCR0_TXCBDIS_Pos                  _U_(19)                                              /**< (TC_PTCR0) Transmitter Circular Buffer Disable Position */
#define TC_PTCR0_TXCBDIS_Msk                  (_U_(0x1) << TC_PTCR0_TXCBDIS_Pos)                   /**< (TC_PTCR0) Transmitter Circular Buffer Disable Mask */
#define TC_PTCR0_TXCBDIS(value)               (TC_PTCR0_TXCBDIS_Msk & ((value) << TC_PTCR0_TXCBDIS_Pos))
#define TC_PTCR0_ERRCLR_Pos                   _U_(24)                                              /**< (TC_PTCR0) Transfer Bus Error Clear Position */
#define TC_PTCR0_ERRCLR_Msk                   (_U_(0x1) << TC_PTCR0_ERRCLR_Pos)                    /**< (TC_PTCR0) Transfer Bus Error Clear Mask */
#define TC_PTCR0_ERRCLR(value)                (TC_PTCR0_ERRCLR_Msk & ((value) << TC_PTCR0_ERRCLR_Pos))
#define TC_PTCR0_Msk                          _U_(0x010F0303)                                      /**< (TC_PTCR0) Register Mask  */


/* -------- TC_PTSR0 : (TC Offset: 0x124) ( R/ 32) Transfer Status Register -------- */
#define TC_PTSR0_RXTEN_Pos                    _U_(0)                                               /**< (TC_PTSR0) Receiver Transfer Enable Position */
#define TC_PTSR0_RXTEN_Msk                    (_U_(0x1) << TC_PTSR0_RXTEN_Pos)                     /**< (TC_PTSR0) Receiver Transfer Enable Mask */
#define TC_PTSR0_RXTEN(value)                 (TC_PTSR0_RXTEN_Msk & ((value) << TC_PTSR0_RXTEN_Pos))
#define TC_PTSR0_TXTEN_Pos                    _U_(8)                                               /**< (TC_PTSR0) Transmitter Transfer Enable Position */
#define TC_PTSR0_TXTEN_Msk                    (_U_(0x1) << TC_PTSR0_TXTEN_Pos)                     /**< (TC_PTSR0) Transmitter Transfer Enable Mask */
#define TC_PTSR0_TXTEN(value)                 (TC_PTSR0_TXTEN_Msk & ((value) << TC_PTSR0_TXTEN_Pos))
#define TC_PTSR0_RXCBEN_Pos                   _U_(16)                                              /**< (TC_PTSR0) Receiver Circular Buffer Enable Position */
#define TC_PTSR0_RXCBEN_Msk                   (_U_(0x1) << TC_PTSR0_RXCBEN_Pos)                    /**< (TC_PTSR0) Receiver Circular Buffer Enable Mask */
#define TC_PTSR0_RXCBEN(value)                (TC_PTSR0_RXCBEN_Msk & ((value) << TC_PTSR0_RXCBEN_Pos))
#define TC_PTSR0_TXCBEN_Pos                   _U_(18)                                              /**< (TC_PTSR0) Transmitter Circular Buffer Enable Position */
#define TC_PTSR0_TXCBEN_Msk                   (_U_(0x1) << TC_PTSR0_TXCBEN_Pos)                    /**< (TC_PTSR0) Transmitter Circular Buffer Enable Mask */
#define TC_PTSR0_TXCBEN(value)                (TC_PTSR0_TXCBEN_Msk & ((value) << TC_PTSR0_TXCBEN_Pos))
#define TC_PTSR0_ERR_Pos                      _U_(24)                                              /**< (TC_PTSR0) Transfer Bus Error Position */
#define TC_PTSR0_ERR_Msk                      (_U_(0x1) << TC_PTSR0_ERR_Pos)                       /**< (TC_PTSR0) Transfer Bus Error Mask */
#define TC_PTSR0_ERR(value)                   (TC_PTSR0_ERR_Msk & ((value) << TC_PTSR0_ERR_Pos))  
#define TC_PTSR0_Msk                          _U_(0x01050101)                                      /**< (TC_PTSR0) Register Mask  */


